#include <stdio.h>

int main()
{
	int id = 201812145;
	printf("%d님의 성적표는 아래와 같습니다.\n",id);
	printf("---------------------------------------\n");
	int a=83, b=89, c=93, d=74, e=92;
	printf("과목1  : %d\n", a);
	printf("과목2  : %d\n", b);
	printf("과목3  : %d\n", c);
	printf("과목4  : %d\n", d);
	printf("과목5  : %d\n", e);
	printf("---------------------------------------\n");
	printf("평균  : %d\n",(a + b + c + d + e) / 5);
	printf("---------------------------------------\n");
	/*수고하셨습니다*/
}